{
  "backend/main.mo": "Motoko actor defining the blood donor management system with types for BloodGroup, DonorStatus, and Donor, plus functions for CRUD operations, status updates, call tracking (incrementing callCount and lastCalledDate), and donation marking with 3-month cooldown logic.",
  "feature_evidence.json": "Feature evidence report mapping six requirements (REQ-38 through REQ-43) to specific frontend files, documenting sorting logic changes in AppointedDonorsList.tsx and DonorTable.tsx, call count column additions, and query invalidation for instant UI refresh.",
  "frontend-file-summaries.txt": "JSON object containing one-sentence summaries of all frontend files, describing component responsibilities, sorting behavior, call recording flow, and styling approach across the application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining a medical-themed OKLCH color palette (emerald greens and teal accents) for both light and dark modes.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'Personal Blood Donor Management System', and script tag loading the React application from main.tsx.",
  "frontend/src/App.tsx": "Root React component managing Internet Identity authentication, rendering a login screen for unauthenticated users and the authenticated layout with header, HomePage content, footer with caffeine.ai attribution, and Toaster for notifications.",
  "frontend/src/components/AddDonorDialog.tsx": "Dialog component with form for adding new donors, including name, blood group dropdown, and phone number fields with validation, using useAddDonor mutation and displaying success/error toasts.",
  "frontend/src/components/AppointedDonorsList.tsx": "Displays a sortable table of appointed donors with actions to mark them as donated (moves to temporary rejected) or not donated (returns to active). Sorts donors by last called date (nulls first, then oldest to newest) and call count.",
  "frontend/src/components/BloodRequirementForm.tsx": "Provides a blood group selector to filter and display available donors, with call functionality that records the call, opens the phone dialer, and launches a post-call form. Supports filtering by specific blood group or showing all donors.",
  "frontend/src/components/DeleteConfirmationDialog.tsx": "A confirmation dialog component that permanently deletes a donor from the system after user confirmation, with loading state and toast notifications.",
  "frontend/src/components/DonorTable.tsx": "Displays all donors in a sortable table (alphabetically by name, then by blood group) with status badges and action buttons for calling, editing, and deleting donors. Integrates with PostCallForm, EditDonorDialog, and DeleteConfirmationDialog.",
  "frontend/src/components/EditDonorDialog.tsx": "A dialog form for editing existing donor information (name, blood group, phone number) with validation and toast notifications for success/error states.",
  "frontend/src/components/PermanentRejectedDonorsList.tsx": "Displays a read-only table of permanently rejected donors showing their name, blood group, and phone number with red-themed styling.",
  "frontend/src/components/PostCallForm.tsx": "A dialog form component for recording post-call outcomes with a donor, allowing the user to mark them as approved (with appointment details), temporarily rejected (with available date), permanently rejected, or not attended. Validates inputs and calls the updateDonorStatus mutation with appropriate status objects.",
  "frontend/src/components/TempRejectedDonorsList.tsx": "Displays a table of temporarily rejected donors with their blood group, phone number, and available date. Distinguishes between 'Donated' status (if available date is ~90 days from now) and 'Rejected' status using badges.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an actor instance for backend communication, using either an authenticated or anonymous identity. Invalidates and refetches dependent queries when the actor changes due to identity updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality using @dfinity/auth-client. Manages authentication state, identity persistence, and exposes login status flags (isInitializing, isLoggingIn, etc.).",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all donor-related operations including fetching donors by various filters (all, blood group, appointed, rejected), and mutations for adding, editing, deleting donors and updating their status. All mutations invalidate the 'donors' query cache on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a medical-themed color palette (soft greens, teals, calming colors) for both light and dark modes. Includes chart color definitions and base styling for the application.",
  "frontend/src/main.tsx": "Application entry point that sets up the React root with QueryClientProvider for React Query state management and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/pages/HomePage.tsx": "Main page component that renders a dashboard with navigation cards for five sections (Total Donor List, Blood Requirement, Appointed Donors, Temporary Rejected, Permanent Rejected) and conditionally displays the selected section's content with appropriate forms and tables.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom color schemes using OKLCH color space, extends theme with custom border radius, shadows, animations (accordion), and includes typography, container queries, and animate plugins.",
  "project_state.json": "Project metadata file documenting a single-user blood donor management system with architectural notes on donor status workflows, 3-month donation cooldowns, call tracking, rejection reasons, and a list of implemented features mapped to requirement IDs."
}