{
  "backend/main.mo": "Motoko actor defining a blood donor management system with types for BloodGroup, DonorStatus, and Donor, plus functions to add donors, update status, and query donors by various filters (all, by blood group, by status type).",
  "feature_evidence.json": "Feature evidence report documenting two features related to debugging the Add Donor functionality and verifying the addDonor mutation's backend response handling.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components for donor management, tables, forms, dialogs, and styling with medical-themed color palette.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining a medical-themed OKLCH color system for light and dark modes with emerald and teal accents.",
  "frontend/index.html": "HTML entry point for the Personal Blood Donor Management System React application.",
  "frontend/src/App.tsx": "Main React component providing Internet Identity authentication, login screen, and authenticated layout with header, footer, and HomePage content wrapped in ThemeProvider.",
  "frontend/src/components/AddDonorDialog.tsx": "Dialog component with form for adding new donors (name, blood group, phone number) using useAddDonor mutation hook with validation, error handling, and toast notifications.",
  "frontend/src/components/AppointedDonorsList.tsx": "Table component displaying appointed donors with their appointment date and patient name, using blue-themed styling and loading states.",
  "frontend/src/components/BloodRequirementForm.tsx": "Component for searching donors by blood group with a dropdown selector, displaying matching donors in a table, and initiating calls with a post-call form dialog.",
  "frontend/src/components/DonorTable.tsx": "Displays all donors in a table with name, blood group, phone number, and status badges, with call buttons that trigger the phone dialer and post-call form.",
  "frontend/src/components/PermanentRejectedDonorsList.tsx": "Displays a read-only table of permanently rejected donors showing their name, blood group, and phone number with red-themed styling.",
  "frontend/src/components/PostCallForm.tsx": "Dialog form for recording call outcomes (approved/rejected/not attended) with conditional fields for appointment details, temporary rejection dates, or permanent rejection, updating donor status via mutation.",
  "frontend/src/components/TempRejectedDonorsList.tsx": "Displays temporarily rejected donors in a table with their available date, using amber-themed styling and date formatting from nanosecond timestamps.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and status tracking through React Context and AuthClient integration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating donor data, including queries for all donors, donors by blood group, and donors by status (appointed, temp rejected, permanently rejected), plus mutations for adding donors and updating donor status.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a medical-themed color palette (soft greens, teals) for both light and dark modes, including primary, secondary, accent, destructive, and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and wraps the App component with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/HomePage.tsx": "Main dashboard page displaying sections for total donor list, blood requirement form, appointed donors, temporary rejected donors, permanent rejected donors, and an add donor button that opens a dialog.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom colors using OKLCH color space, border radius variables, custom shadows, accordion animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing a single-user blood donor management system with admin-only access, donor status workflows, blood group filtering, and a known issue in the add donor section that needs fixing."
}