{
  "backend/main.mo": "Motoko actor implementing a blood donor management system with CRUD operations for donors, status tracking (active/appointed/rejected), call recording, donation marking with 3-month cooldown, and blood group filtering functionality.",
  "feature_evidence.json": "Feature evidence report documenting four high-confidence features related to refactoring HomePage.tsx to use section navigation instead of inline rendering, with state management, back button, and preserved Add Donor functionality.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the authentication flow, navigation-based dashboard, donor tables, forms for blood requirements and post-call responses, and various donor list components with medical-themed styling.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining a medical-themed OKLCH color system for light and dark modes, featuring emerald greens and teal accents for healthcare-appropriate styling.",
  "frontend/index.html": "HTML entry point for the React application with title 'Personal Blood Donor Management System' and root div mounting point.",
  "frontend/src/App.tsx": "Main React component handling Internet Identity authentication, displaying login screen for unauthenticated users, and rendering authenticated layout with header, footer (including caffeine.ai attribution), and HomePage content.",
  "frontend/src/components/AddDonorDialog.tsx": "Dialog component with form for adding new donors, including name, blood group selection, and phone number fields with validation, error handling, and success toast notifications.",
  "frontend/src/components/AppointedDonorsList.tsx": "Displays a sortable table of appointed donors with actions to mark them as donated (moves to temporary rejected for 3 months) or not donated (returns to active status). Sorts donors by last called date and call count.",
  "frontend/src/components/BloodRequirementForm.tsx": "Provides a blood group selector to filter and display available donors, with a call button that records the call, opens the phone dialer, and launches a post-call form for each donor.",
  "frontend/src/components/DeleteConfirmationDialog.tsx": "A confirmation dialog component that permanently deletes a donor from the system with loading state and toast notifications.",
  "frontend/src/components/DonorTable.tsx": "Displays all donors in a table with status badges, call functionality, and edit/delete actions. Integrates with PostCallForm, EditDonorDialog, and DeleteConfirmationDialog components.",
  "frontend/src/components/EditDonorDialog.tsx": "A dialog form for editing donor information (name, blood group, phone number) with validation and toast notifications on success or error.",
  "frontend/src/components/PermanentRejectedDonorsList.tsx": "Displays a read-only table of permanently rejected donors showing their name, blood group, and phone number with appropriate styling.",
  "frontend/src/components/PostCallForm.tsx": "A dialog form component for recording post-call outcomes with a donor, supporting approval (with appointment details), temporary rejection (with available date), permanent rejection, or no-show status updates.",
  "frontend/src/components/TempRejectedDonorsList.tsx": "Displays a table of temporarily rejected donors with their blood group, phone number, available date, and status badge (showing 'Donated' if the available date suggests a 90-day donation cooldown).",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous actor instance based on Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout, managing identity state and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all donor-related operations including fetching donors by status/blood group, adding/editing/deleting donors, updating donor status, and marking donors as donated.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a medical-themed color palette (soft greens, teals) for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/HomePage.tsx": "Main homepage component that renders a dashboard with navigation cards for different donor management sections (total donors, blood requirements, appointed/rejected lists) and conditionally displays the selected section's content with appropriate headers and action buttons.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom theme extensions including OKLCH color system for design tokens, container settings, border radius variables, custom animations (accordion), and integrates typography, container queries, and animate plugins.",
  "project_state.json": "Project state document tracking the Blood Donor Management System's architecture, features, and requirements including single-user admin access, donor status workflows, 3-month donation cooldown, call tracking with sorting by last called date and call count, and blood group filtering capabilities."
}