{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix donor sorting logic and add Call Count to Total Donor List",
  "requirements": [
    {
      "id": "REQ-38",
      "summary": "Reverse the sorting logic in AppointedDonorsList.tsx so donors NOT called recently appear at the TOP",
      "acceptanceCriteria": [
        "Donors with no lastCalledDate (null) appear first",
        "Donors with older lastCalledDate values appear before donors with newer values",
        "The sorting order is descending by lastCalledDate timestamp"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppointedDonorsList.tsx",
          "operation": "modify",
          "description": "Update the sorting logic to place donors with null lastCalledDate at the top, followed by donors sorted in descending order by lastCalledDate (oldest dates first, most recent dates last). Replace the current ascending sort with descending sort, ensuring null values are treated as the highest priority."
        }
      ]
    },
    {
      "id": "REQ-39",
      "summary": "Maintain secondary sorting by Call Count (ascending, lowest first) when two donors have the same Last Called Date",
      "acceptanceCriteria": [
        "When lastCalledDate values match, donors with lower callCount appear first",
        "Secondary sort applies correctly across all date groups"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppointedDonorsList.tsx",
          "operation": "modify",
          "description": "Enhance the sorting comparator to include secondary sorting by callCount in ascending order when lastCalledDate values are equal. Ensure the secondary sort preserves the nulls-first logic from REQ-38."
        }
      ]
    },
    {
      "id": "REQ-40",
      "summary": "Ensure the Appointed Donors list automatically updates and refreshes instantly after the Call button is clicked",
      "acceptanceCriteria": [
        "React Query invalidation triggers immediate refetch after recordCall mutation",
        "UI updates without manual refresh or page reload",
        "Sorting reflects the updated lastCalledDate and callCount immediately"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Verify that the recordCall mutation includes React Query invalidation for the appointed donors query. Add or update the onSuccess handler to invalidate ['getAllAppointedDonors'] query key, ensuring immediate refetch and UI update after call recording."
        },
        {
          "path": "frontend/src/components/BloodRequirementForm.tsx",
          "operation": "modify",
          "description": "Verify that the call recording flow in the BloodRequirementForm component triggers the recordCall mutation properly and that React Query cache invalidation propagates to the AppointedDonorsList component for instant refresh."
        }
      ]
    },
    {
      "id": "REQ-41",
      "summary": "Add a 'Calls' column to the Total Donor List section displaying the callCount value",
      "acceptanceCriteria": [
        "Call Count column is visible in DonorTable component",
        "Column displays the numeric callCount value for each donor",
        "Column header is labeled 'Calls' or 'Call Count'"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DonorTable.tsx",
          "operation": "modify",
          "description": "Add a new 'Calls' column to the table between the existing columns. Include a TableHead with label 'Calls' or 'Call Count', and render a TableCell displaying donor.callCount for each row. Position the column logically near other donor information fields."
        }
      ]
    },
    {
      "id": "REQ-42",
      "summary": "Implement alphabetical sorting by donor name as the primary sort in DonorTable.tsx",
      "acceptanceCriteria": [
        "Donors are sorted alphabetically by name (A-Z)",
        "Sorting is case-insensitive",
        "Alphabetical order is the primary sort criterion"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DonorTable.tsx",
          "operation": "modify",
          "description": "Add sorting logic before rendering the donor rows to sort all donors alphabetically by name using case-insensitive string comparison (A-Z). Use Array.sort with localeCompare for proper alphabetical ordering."
        }
      ]
    },
    {
      "id": "REQ-43",
      "summary": "Implement secondary sorting by blood group in DonorTable.tsx when donor names are identical",
      "acceptanceCriteria": [
        "When names match, donors are sorted by blood group",
        "Blood group sort order follows standard grouping (e.g., A+, A-, B+, B-, AB+, AB-, O+, O-)",
        "Secondary sort only applies when primary sort values are equal"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DonorTable.tsx",
          "operation": "modify",
          "description": "Enhance the sorting comparator from REQ-42 to include secondary sorting by blood group when donor names are identical. Define a blood group ordering array following standard grouping and compare blood groups when name comparison returns 0."
        }
      ]
    },
    {
      "id": "REQ-44",
      "summary": "Ensure the recent call sorting logic applies ONLY to the Appointed Donors section and not to the Total Donor List section",
      "acceptanceCriteria": [
        "AppointedDonorsList.tsx uses lastCalledDate and callCount for sorting",
        "DonorTable.tsx uses name and blood group for sorting",
        "No call-based sorting logic appears in DonorTable.tsx"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DonorTable.tsx",
          "operation": "modify",
          "description": "Review the DonorTable component to ensure it contains no sorting logic based on lastCalledDate or callCount. Verify that only name and blood group sorting (as implemented in REQ-42 and REQ-43) are present in this component."
        },
        {
          "path": "frontend/src/components/AppointedDonorsList.tsx",
          "operation": "modify",
          "description": "Verify that the sorting logic in AppointedDonorsList uses only lastCalledDate and callCount (as implemented in REQ-38 and REQ-39), and does not include name or blood group sorting. Ensure the two components maintain distinct sorting behaviors."
        }
      ]
    }
  ]
}